In [1]:
from pyspark.sql import SparkSession

spark = (
    SparkSession
    .builder
    .appName("4_sort_and_union")
    .master("local[*]")
    .getOrCreate()
)

spark

In [2]:
emp_data_1 = [
    ["001","101","John Doe","30","Male","50000","2015-01-01"],
    ["002","101","Jane Smith","25","Female","45000","2016-02-15"],
    ["003","102","Bob Brown","35","Male","55000","2014-05-01"],
    ["004","102","Alice Lee","28","Female","48000","2017-09-30"],
    ["005","103","Jack Chan","40","Male","60000","2013-04-01"],
    ["006","103","Jill Wong","32","Female","52000","2018-07-01"],
    ["007","101","James Johnson","42","Male","70000","2012-03-15"],
    ["008","102","Kate Kim","29","Female","51000","2019-10-01"],
    ["009","103","Tom Tan","33","Male","58000","2016-06-01"],
    ["010","104","Lisa Lee","27","Female","47000","2018-08-01"]
]

emp_data_2 = [
    ["011","104","David Park","38","Male","65000","2015-11-01"],
    ["012","105","Susan Chen","31","Female","54000","2017-02-15"],
    ["013","106","Brian Kim","45","Male","75000","2011-07-01"],
    ["014","107","Emily Lee","26","Female","46000","2019-01-01"],
    ["015","106","Michael Lee","37","Male","63000","2014-09-30"],
    ["016","107","Kelly Zhang","30","Female","49000","2018-04-01"],
    ["017","105","George Wang","34","Male","57000","2016-03-15"],
    ["018","104","Nancy Liu","29","","50000","2017-06-01"],
    ["019","103","Steven Chen","36","Male","62000","2015-08-01"],
    ["020","102","Grace Kim","32","Female","53000","2018-11-01"]
]

emp_schema = "employee_id string, department_id string, name string, age string, gender string, salary string, hire_date string"

df1 = spark.createDataFrame(data = emp_data_1, schema = emp_schema)
df2 = spark.createDataFrame(data = emp_data_2, schema = emp_schema)


df1.show(5)
df2.show(5)

+-----------+-------------+----------+---+------+------+----------+
|employee_id|department_id|      name|age|gender|salary| hire_date|
+-----------+-------------+----------+---+------+------+----------+
|        001|          101|  John Doe| 30|  Male| 50000|2015-01-01|
|        002|          101|Jane Smith| 25|Female| 45000|2016-02-15|
|        003|          102| Bob Brown| 35|  Male| 55000|2014-05-01|
|        004|          102| Alice Lee| 28|Female| 48000|2017-09-30|
|        005|          103| Jack Chan| 40|  Male| 60000|2013-04-01|
+-----------+-------------+----------+---+------+------+----------+
only showing top 5 rows

+-----------+-------------+-----------+---+------+------+----------+
|employee_id|department_id|       name|age|gender|salary| hire_date|
+-----------+-------------+-----------+---+------+------+----------+
|        011|          104| David Park| 38|  Male| 65000|2015-11-01|
|        012|          105| Susan Chen| 31|Female| 54000|2017-02-15|
|        013|          106|  Brian Kim| 45|  Male| 75000|2011-07-01|
|        014|          107|  Emily Lee| 26|Female| 46000|2019-01-01|
|        015|          106|Michael Lee| 37|  Male| 63000|2014-09-30|
+-----------+-------------+-----------+---+------+------+----------+
only showing top 5 rows

In [3]:
df1.union(df2).show(5)

+-----------+-------------+----------+---+------+------+----------+
|employee_id|department_id|      name|age|gender|salary| hire_date|
+-----------+-------------+----------+---+------+------+----------+
|        001|          101|  John Doe| 30|  Male| 50000|2015-01-01|
|        002|          101|Jane Smith| 25|Female| 45000|2016-02-15|
|        003|          102| Bob Brown| 35|  Male| 55000|2014-05-01|
|        004|          102| Alice Lee| 28|Female| 48000|2017-09-30|
|        005|          103| Jack Chan| 40|  Male| 60000|2013-04-01|
+-----------+-------------+----------+---+------+------+----------+
only showing top 5 rows

In [4]:
# includes all the duplicates.
df1.unionAll(df2).show(5)

+-----------+-------------+----------+---+------+------+----------+
|employee_id|department_id|      name|age|gender|salary| hire_date|
+-----------+-------------+----------+---+------+------+----------+
|        001|          101|  John Doe| 30|  Male| 50000|2015-01-01|
|        002|          101|Jane Smith| 25|Female| 45000|2016-02-15|
|        003|          102| Bob Brown| 35|  Male| 55000|2014-05-01|
|        004|          102| Alice Lee| 28|Female| 48000|2017-09-30|
|        005|          103| Jack Chan| 40|  Male| 60000|2013-04-01|
+-----------+-------------+----------+---+------+------+----------+
only showing top 5 rows

In [8]:
# Sort the emp data based on desc Salary
# select * from emp order by salary desc
from pyspark.sql.functions import col

df1.sort("salary").show(5)
df1.orderBy(col("salary")).show(5)

+-----------+-------------+----------+---+------+------+----------+
|employee_id|department_id|      name|age|gender|salary| hire_date|
+-----------+-------------+----------+---+------+------+----------+
|        002|          101|Jane Smith| 25|Female| 45000|2016-02-15|
|        010|          104|  Lisa Lee| 27|Female| 47000|2018-08-01|
|        004|          102| Alice Lee| 28|Female| 48000|2017-09-30|
|        001|          101|  John Doe| 30|  Male| 50000|2015-01-01|
|        008|          102|  Kate Kim| 29|Female| 51000|2019-10-01|
+-----------+-------------+----------+---+------+------+----------+
only showing top 5 rows

+-----------+-------------+----------+---+------+------+----------+
|employee_id|department_id|      name|age|gender|salary| hire_date|
+-----------+-------------+----------+---+------+------+----------+
|        002|          101|Jane Smith| 25|Female| 45000|2016-02-15|
|        010|          104|  Lisa Lee| 27|Female| 47000|2018-08-01|
|        004|          102| Alice Lee| 28|Female| 48000|2017-09-30|
|        001|          101|  John Doe| 30|  Male| 50000|2015-01-01|
|        008|          102|  Kate Kim| 29|Female| 51000|2019-10-01|
+-----------+-------------+----------+---+------+------+----------+
only showing top 5 rows

In [12]:
# Aggregation
# select dept_id, count(employee_id) as total_dept_count from emp_sorted group by dept_id

from pyspark.sql.functions import count
df1.groupBy("department_id").agg(count("employee_id").alias("EmployeeCount")).show(5)

+-------------+-------------+
|department_id|EmployeeCount|
+-------------+-------------+
|          101|            3|
|          102|            3|
|          103|            3|
|          104|            1|
+-------------+-------------+

In [14]:
# Aggregation
# select dept_id, sum(salary) as total_dept_salary from emp_sorted group by dept_id
from pyspark.sql.functions import sum

df1.groupBy("department_id").agg(sum("salary").alias("total_dept_salary")).orderBy("department_id").show()

+-------------+-----------------+
|department_id|total_dept_salary|
+-------------+-----------------+
|          101|         165000.0|
|          102|         154000.0|
|          103|         170000.0|
|          104|          47000.0|
+-------------+-----------------+

In [17]:
# Aggregation with having clause
# select dept_id, avg(salary) as avg_dept_salary from emp_sorted  group by dept_id having avg(salary) > 50000

from pyspark.sql.functions import avg
df1.groupBy("department_id").agg(avg("salary").alias("average_salary")).show(5)
df1.groupBy("department_id").agg(avg("salary").alias("average_salary")).where("average_salary > 50000").show()

+-------------+------------------+
|department_id|    average_salary|
+-------------+------------------+
|          101|           55000.0|
|          102|51333.333333333336|
|          103|56666.666666666664|
|          104|           47000.0|
+-------------+------------------+

+-------------+------------------+
|department_id|    average_salary|
+-------------+------------------+
|          101|           55000.0|
|          102|51333.333333333336|
|          103|56666.666666666664|
+-------------+------------------+

In [18]:
# Bonus TIP - unionByName

df1.unionByName(df2).show(5)

+-----------+-------------+----------+---+------+------+----------+
|employee_id|department_id|      name|age|gender|salary| hire_date|
+-----------+-------------+----------+---+------+------+----------+
|        001|          101|  John Doe| 30|  Male| 50000|2015-01-01|
|        002|          101|Jane Smith| 25|Female| 45000|2016-02-15|
|        003|          102| Bob Brown| 35|  Male| 55000|2014-05-01|
|        004|          102| Alice Lee| 28|Female| 48000|2017-09-30|
|        005|          103| Jack Chan| 40|  Male| 60000|2013-04-01|
+-----------+-------------+----------+---+------+------+----------+
only showing top 5 rows

In [1]:
spark.stop()

NameError: name 'spark' is not defined